package com.bird.sso.web.conts;

public enum ResultEnum {


    处理成功(200),

    处理失败(500),

    请求参数不匹配(400),

    用户已存在(100),

    用户不存在(101),

    信息不允许修改(102),

    用户登录失败(5001),

    用户登陆过期(5002),

    用户权限不足(5003),

    旧密码校验失败(5004),



    认证失败(401),
    尚未登录(50010),
    尚未注册(50011),

    该手机已被绑定(50012),
    验证码已过期(50014),
    已注册(50015),
    原密码输入错误(50016),
    用户账号或密码输入错误(50017),
    密码输入错误(50018),

    手机号不合法(50019),

    原验证码在有效期内(50020),
    验证码输入错误(50021),
    ;

    public int code;

    ResultEnum(int code) {
        this.code = code;
    }
}
